Tekla Open API Reference for Tekla Structures 2025
Position.Rotation Property
 Indicates the positioning in the rotational sense.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Position.RotationEnum Rotation { get; set; }
Public Property Rotation As Position.RotationEnum
	Get
	Set
Property Value
Type: Position.RotationEnum
See Also
Reference
Position Class
Tekla.Structures.Model Namespace